# Desafio de Análise de Dados

![descrição_da_imagem](Imagem/up.jpg)

## Objetivo

Gerar um novo relatório de pagamento dos afiliados.

Calcular a soma total de apostas do cliente no banco de dados de cada afiliado encontrado no arquivo CSV.

Utilizando os totais das apostas e os dados da tabela limites, determinar a porcentagem aplicada ao pagamento final.

Determine a porcentagem necessária para calcular o valor de acréscimo com base nas informações fornecidas na tabela limites.

Aplique a porcentagem encontrada ao valor na coluna "pagamentos" do CSV para obter o pagamento final.

Usar alguma ferramente de BI (Databricks, Tableau, Apache Spark, Python Pandas e Jupiter) ou relacionadas.

No assunto do email coloque essa chave [Desafio-Dados].

### Instalando e Carregando os Pacotes

In [1]:
# Versão da Linguagem Python
from platform import python_version
print('Versão da Linguagem Python Usada Neste Jupyter Notebook:', python_version())

Versão da Linguagem Python Usada Neste Jupyter Notebook: 3.11.5

In [2]:
# Imports
import numpy as np
import pandas as pd

In [34]:
# Carregar o dataset sem a primeira linha como cabeçalho
df_limits  = pd.read_csv('dados/limits.csv', header=None)

# Definindo os títulos das colunas tirados da base de dados
titulos_colunas = ['id', 'amount', 'porcent', 'date']

# Definindo os títulos das colunas no Dataset
df_limits.columns = titulos_colunas

In [35]:
# Verificando os dataset limits
df_limits .head()

   id  amount  porcent                    date
0   1     100       10  2023-11-10 00:00:00+00
1   2     200       15  2023-11-10 00:00:00+00
2   3     300       20  2023-11-10 00:00:00+00
3   5     500       30  2023-11-10 00:00:00+00
4   4     400       25  2023-11-10 00:00:00+00

In [36]:
# Info
df_limits .info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       5 non-null      int64
 1   amount   5 non-null      int64
 2   porcent  5 non-null      int64
 3   date     5 non-null      object
dtypes: int64(3), object(1)
memory usage: 292.0+ bytes

In [18]:
# # Carregar o dataset sem a primeira linha como cabeçalho
df_customers  = pd.read_csv('dados/customers.csv', header=None)

In [19]:
# Shape
df_customers .shape

(10, 9)

In [20]:
df_customers .head(20)

,0,1,2,3,4,5,6,7,8
0,1,John Doe,t,1268759214,123-456-7890,john@example.com,100.50,1110112023,2023-11-10 00:00:00+00
1,2,Jane Smith,f,1268759215,123-456-7891,jane@example.com,150.75,1120112023,2023-11-10 01:00:00+00
2,3,Alice Johnson,t,1268759216,123-456-7892,alice@example.com,200.00,1130112023,2023-11-10 02:00:00+00
3,4,Bob Williams,f,1268759217,123-456-7893,bob@example.com,250.25,1140112023,2023-11-10 03:00:00+00
4,5,Charlie Brown,t,1268759218,123-456-7894,charlie@example.com,300.50,1150112023,2023-11-10 04:00:00+00
5,6,Diana King,f,1268759219,123-456-7895,diana@example.com,350.75,1160112023,2023-11-10 05:00:00+00
6,7,Edward Knight,t,1268759220,123-456-7896,edward@example.com,400.00,1170112023,2023-11-10 06:00:00+00
7,8,Fiona Queen,f,1268759221,123-456-7897,fiona@example.com,450.25,1185942023,2023-11-10 07:00:00+00
8,9,George Prince,t,1268759222,123-456-7898,george@example.com,500.50,1195942023,2023-11-10 08:00:00+00
9,10,Helen Princess,f,1268759223,123-456-7899,helen@example.com,550.75,1545942023,2023-11-10 09:00:00+00

In [21]:
# Definindo os títulos das colunas tirados da base de dados
titulos_colunas = ['id', 'name', 'status', 'code', 'phone', 'email', 'balance', 'customer_id', 'date']

# Definindo os títulos das colunas no Dataset
df_customers .columns = titulos_colunas

In [22]:
df_customers .head(20)

,id,name,status,code,phone,email,balance,customer_id,date
0,1,John Doe,t,1268759214,123-456-7890,john@example.com,100.50,1110112023,2023-11-10 00:00:00+00
1,2,Jane Smith,f,1268759215,123-456-7891,jane@example.com,150.75,1120112023,2023-11-10 01:00:00+00
2,3,Alice Johnson,t,1268759216,123-456-7892,alice@example.com,200.00,1130112023,2023-11-10 02:00:00+00
3,4,Bob Williams,f,1268759217,123-456-7893,bob@example.com,250.25,1140112023,2023-11-10 03:00:00+00
4,5,Charlie Brown,t,1268759218,123-456-7894,charlie@example.com,300.50,1150112023,2023-11-10 04:00:00+00
5,6,Diana King,f,1268759219,123-456-7895,diana@example.com,350.75,1160112023,2023-11-10 05:00:00+00
6,7,Edward Knight,t,1268759220,123-456-7896,edward@example.com,400.00,1170112023,2023-11-10 06:00:00+00
7,8,Fiona Queen,f,1268759221,123-456-7897,fiona@example.com,450.25,1185942023,2023-11-10 07:00:00+00
8,9,George Prince,t,1268759222,123-456-7898,george@example.com,500.50,1195942023,2023-11-10 08:00:00+00
9,10,Helen Princess,f,1268759223,123-456-7899,helen@example.com,550.75,1545942023,2023-11-10 09:00:00+00

In [23]:
# Shape
df_customers .shape

(10, 9)

In [24]:
# Info
df_customers .info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           10 non-null     int64
 1   name         10 non-null     object
 2   status       10 non-null     object
 3   code         10 non-null     int64
 4   phone        10 non-null     object
 5   email        10 non-null     object
 6   balance      10 non-null     float64
 7   customer_id  10 non-null     int64
 8   date         10 non-null     object
dtypes: float64(1), int64(3), object(5)
memory usage: 852.0+ bytes

In [26]:
# Carregar o dataset affiliates
df_affiliates = pd.read_csv('dados/affiliates.csv')

In [27]:
df_affiliates.head(20)

             name  affiliate_id        date  payment  customer_id
0    Emma Johnson        349779  2023-11-26   197.42   1545942023
1      John Smith        589485  2023-11-14   160.95   1195942023
2    Sophia Davis        586264  2023-11-11   194.28   1185942023
3    Emma Johnson        349779  2023-11-17   112.61   1150112023
4  Michael Miller        798583  2023-11-13   178.82   1170112023
5  Michael Miller        798583  2023-11-23   144.38   1110112023
6      John Smith        589485  2023-11-15   165.14   1140112023
7    Emma Johnson        349779  2023-11-12   233.10   1160112023
8    Emma Johnson        349779  2023-11-24   154.10   1120112023
9    Sophia Davis        586264  2023-11-14   224.81   1130112023

In [28]:
# Shape
df_affiliates.shape

(10, 5)

In [29]:
# Info
df_affiliates.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   name          10 non-null     object
 1   affiliate_id  10 non-null     int64
 2   date          10 non-null     object
 3   payment       10 non-null     float64
 4   customer_id   10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

### Respondendo as Questões

In [30]:
# Calculando a soma total de apostas do cliente para cada afiliado
df_customers_grouped = df_customers.groupby('customer_id')['balance'].sum().reset_index()
df_customers_grouped.columns = ['customer_id', 'total_apostas']
df_afiliados_clientes = pd.merge(df_affiliates, df_customers_grouped, on='customer_id', how='left')

In [31]:
print(df_afiliados_clientes)

             name  affiliate_id        date  payment  customer_id  \
0    Emma Johnson        349779  2023-11-26   197.42   1545942023
1      John Smith        589485  2023-11-14   160.95   1195942023
2    Sophia Davis        586264  2023-11-11   194.28   1185942023
3    Emma Johnson        349779  2023-11-17   112.61   1150112023
4  Michael Miller        798583  2023-11-13   178.82   1170112023
5  Michael Miller        798583  2023-11-23   144.38   1110112023
6      John Smith        589485  2023-11-15   165.14   1140112023
7    Emma Johnson        349779  2023-11-12   233.10   1160112023
8    Emma Johnson        349779  2023-11-24   154.10   1120112023
9    Sophia Davis        586264  2023-11-14   224.81   1130112023

   total_apostas
0         550.75
1         500.50
2         450.25
3         300.50
4         400.00
5         100.50
6         250.25
7         350.75
8         150.75
9         200.00

In [32]:
# Determinando a porcentagem de acréscimo com base na tabela limits
def calcular_porcentagem(valor, df_limits):
    for index, row in df_limits.iterrows():
        if valor <= row['amount']:
            return row['porcent']
    return 50  # Se o valor for maior que o limite máximo de R$500

In [37]:
# Calculando o pagamento final
df_afiliados_clientes['porcentagem_acrescimo'] = df_afiliados_clientes['total_apostas'].apply(calcular_porcentagem, args=(df_limits,))
df_afiliados_clientes['pagamento_final'] = df_afiliados_clientes['payment'] * (df_afiliados_clientes['porcentagem_acrescimo'] / 100)

In [38]:
print(df_afiliados_clientes)

             name  affiliate_id        date  payment  customer_id  \
0    Emma Johnson        349779  2023-11-26   197.42   1545942023
1      John Smith        589485  2023-11-14   160.95   1195942023
2    Sophia Davis        586264  2023-11-11   194.28   1185942023
3    Emma Johnson        349779  2023-11-17   112.61   1150112023
4  Michael Miller        798583  2023-11-13   178.82   1170112023
5  Michael Miller        798583  2023-11-23   144.38   1110112023
6      John Smith        589485  2023-11-15   165.14   1140112023
7    Emma Johnson        349779  2023-11-12   233.10   1160112023
8    Emma Johnson        349779  2023-11-24   154.10   1120112023
9    Sophia Davis        586264  2023-11-14   224.81   1130112023

   total_apostas  porcentagem_acrescimo  pagamento_final
0         550.75                     50          98.7100
1         500.50                     50          80.4750
2         450.25                     30          58.2840
3         300.50                     30          33.7830
4         400.00                     30          53.6460
5         100.50                     15          21.6570
6         250.25                     20          33.0280
7         350.75                     30          69.9300
8         150.75                     15          23.1150
9         200.00                     15          33.7215

In [39]:
# Criando o DataFrame com os dados essenciais do relatório
df_relatorio = df_afiliados_clientes[['affiliate_id', 'customer_id', 'payment', 'total_apostas', 'porcentagem_acrescimo', 'pagamento_final']]

In [40]:
print(df_relatorio)

   affiliate_id  customer_id  payment  total_apostas  porcentagem_acrescimo  \
0        349779   1545942023   197.42         550.75                     50
1        589485   1195942023   160.95         500.50                     50
2        586264   1185942023   194.28         450.25                     30
3        349779   1150112023   112.61         300.50                     30
4        798583   1170112023   178.82         400.00                     30
5        798583   1110112023   144.38         100.50                     15
6        589485   1140112023   165.14         250.25                     20
7        349779   1160112023   233.10         350.75                     30
8        349779   1120112023   154.10         150.75                     15
9        586264   1130112023   224.81         200.00                     15

   pagamento_final
0          98.7100
1          80.4750
2          58.2840
3          33.7830
4          53.6460
5          21.6570
6          33.0280
7          69.9300
8          23.1150
9          33.7215

In [41]:
# Criando uma variáveil para receber o Dataframe necessário para apresentar os gráficos.
relatorio = df_relatorio

In [48]:
relatorio.head(15)

,affiliate_id,customer_id,payment,total_apostas,porcentagem_acrescimo,pagamento_final
0,349779,1545942023,197.42,550.75,50,98.7100
1,589485,1195942023,160.95,500.50,50,80.4750
2,586264,1185942023,194.28,450.25,30,58.2840
3,349779,1150112023,112.61,300.50,30,33.7830
4,798583,1170112023,178.82,400.00,30,53.6460
5,798583,1110112023,144.38,100.50,15,21.6570
6,589485,1140112023,165.14,250.25,20,33.0280
7,349779,1160112023,233.10,350.75,30,69.9300
8,349779,1120112023,154.10,150.75,15,23.1150
9,586264,1130112023,224.81,200.00,15,33.7215

In [46]:
# Exportando o DataFrame para um arquivo CSV
relatorio.to_csv('afiliados.csv', index=False)

In [47]:
# Confirmando
print("DataFrame exportado com sucesso para 'afiliados.csv'")

DataFrame exportado com sucesso para 'afiliados.csv'

# Fim